БухЭксп/Catalogs/CW_ИностранныеБанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ИностранныеБанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер счета или IBAN (International bank account number) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИностранныеБанки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкКорреспондент</Name>
					<Comment>Банк-корреспондент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИностранныеБанки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкПосредникБанкаКорреспондента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИностранныеБанки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>(Регл) Корреспонденский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IBAN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеДляОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ИностранныеБанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем АвтоНаименование;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = 
		?(ЗначениеЗаполнено(Объект.Ссылка.Метаданные().ПредставлениеОбъекта), 
			Объект.Ссылка.Метаданные().ПредставлениеОбъекта, 
			Объект.Ссылка.Метаданные().Синоним
		)
		+ " (" + Строка(Объект.Владелец) + ")"
	;
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.ВидСчета.СписокВыбора.Добавить("Расчетный");
	//Элементы.ВидСчета.СписокВыбора.Добавить("Депозитный");
	//Элементы.ВидСчета.СписокВыбора.Добавить("Ссудный");
	//Элементы.ВидСчета.СписокВыбора.Добавить("Иной");
	Если ЗначениеЗаполнено(Объект.Владелец) И Объект.Ссылка.Пустая() Тогда
		Элементы.Владелец.КнопкаВыбора = Ложь;	
	КонецЕсли; 
	
	АвтоНаименование = СформироватьАвтоНаименование();
КонецПроцедуры

&НаСервере
Функция СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = Лев(""
	                   + Объект.ВалютаДенежныхСредств
	                   + ?(НЕ Объект.Банк.Пустая(), " в " + Объект.Банк, ""), 
					   100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	СтрокаНаименования = Лев(Объект.НомерСчета 
	                   + ?(НЕ Объект.Банк.Пустая(), ", " + Объект.Банк, ""), 
					   100);
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	СтрокаНаименования = Лев(
	                     ?(НЕ Объект.Банк.Пустая(),""+ Объект.Банк, "")
					   +" (" 
	                   + Объект.ВалютаДенежныхСредств
					   +")", 
					   100);
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции

&НаКлиенте
Процедура УстановитьНаименованиеСчета()
	Если Объект.Наименование = АвтоНаименование Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	АвтоНаименование = СформироватьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДенежныхСредствПриИзменении(Элемент)
	УстановитьНаименованиеСчета()
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	УстановитьНаименованиеСчета()
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	УстановитьНаименованиеСчета()
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
